Courses/7140/Lectures/2020-09-03/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-05 Sat 21:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CS7140 Adv Software Engineering 2020-09-03</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">CS7140 Adv Software Engineering 2020-09-03</h1>

<div id="outline-container-org98418ad" class="outline-2">
<h2 id="org98418ad"><span class="section-number-2">1</span> Announcements/ Reminders</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Action Item: Project Work. Form into teams of 3.  Due: Sep 07, 2020 11:59 PM</li>
<li>Action Item: Project Selection.  Due: Sep 07, 2020 11:59 PM</li>
<li>The above are Action Items for Me beyond this due date.</li>
<li>Learn what Discord is: <a href="https://discord.com/">https://discord.com/</a>.  Here is the official
WSU CS Discord server: <a href="https://discord.gg/ks3pV7G">https://discord.gg/ks3pV7G</a>.</li>
</ol>
</div>
</div>

<div id="outline-container-orgff9f805" class="outline-2">
<h2 id="orgff9f805"><span class="section-number-2">2</span> Agenda</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga47b8bd" class="outline-3">
<h3 id="orga47b8bd"><span class="section-number-3">2.1</span> Topics for Today</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>More on Assertions, Specs,  Design, VHLL</li>
<li>Discuss the above using Quick Sort.  
<ol class="org-ol">
<li>You undoubtedly learnt Quick Sort years ago.  May be just one
version.  Re-read whatever you used to learn it initially.
Also, must read the ref given below.  This lecture refreshes
Quicksort while raising a lot of questions.</li>
<li>I am expecting you to figure out the answers and discuss among
your selves on WSU CS Discord server [link given above].</li>
</ol></li>
</ol>
</div>
</div>

<div id="outline-container-orgb0d65a2" class="outline-3">
<h3 id="orgb0d65a2"><span class="section-number-3">2.2</span> Exercises</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Non-Functional Requirement: Assignments to array elements are
disallowed.  Instead, you are given a primitive <code>exchange(i, j)</code>
that exchanges <code>a[i]</code> with <code>a[j]</code>.</li>

<li>Design and implement a Quicksort program that honors the above.
You are welcome to start with the Java program from the Princeton
book.  [We are skipping requirements and specs.]</li>

<li>Specify <code>exchange(i, j)</code>.</li>
<li>Should we revise <code>exchange(i, j)</code> to <code>exchangea(a, i, j)</code>?  Context:
Design of API.</li>
<li>Do an "intriguing" implementation of <code>exchange(i, j)</code>.  What do you
mean "intriguing" ?!</li>
<li>You are required to enjoy (haha!) visiting <a href="https://www.ioccc.org/">https://www.ioccc.org/</a>
The International Obfuscated C Code Contest.  Every year!</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-org3514729" class="outline-2">
<h2 id="org3514729"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>C. A. R. Hoare, Quicksort, The Computer Journal, Volume 5, Issue 1,
1962, Pages 10 - 16, <a href="https://doi.org/10.1093/comjnl/5.1.10">https://doi.org/10.1093/comjnl/5.1.10</a>, PDF at
<a href="https://academic.oup.com/comjnl/article/5/1/10/395338">https://academic.oup.com/comjnl/article/5/1/10/395338</a>.  Required
Reading.</li>

<li>[Princeton Book] Robert Sedgewick and Kevin Wayne,
<a href="https://algs4.cs.princeton.edu/">https://algs4.cs.princeton.edu/</a> 4th Edition; Section on Quicksort.
Required Reading.  <a href="https://algs4.cs.princeton.edu/23quicksort/">https://algs4.cs.princeton.edu/23quicksort/</a></li>
<li><a href="https://cecs.wright.edu/~pmateti/Courses/7140/Lectures/Examples/Quick-Sort/">https://cecs.wright.edu/~pmateti/Courses/7140/Lectures/Examples/Quick-Sort/</a></li>
<li><a href="../Specs/index.html">../Specs/index.html</a>  More lecture time later on this.</li>
</ol>
</div>
</div>


<div id="outline-container-org8a1fb63" class="outline-2">
<h2 id="org8a1fb63"><span class="section-number-2">4</span> End</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2020 <a href="https://cecs.wright.edu/~pmateti"> cecs.wright.edu/~pmateti</a>  2020-09-03
</div>
</body>
</html>
